espressif/esp-idf/tools/test_apps/security/secure_boot/sdkconfig.ci.04
# ESP32-S2 Secure Boot & Flash Encryption (Release mode)
CONFIG_IDF_TARGET="esp32s2"
CONFIG_SECURE_BOOT=y
CONFIG_SECURE_BOOT_SIGNING_KEY="test_rsa_3072_key.pem"
CONFIG_SECURE_FLASH_ENC_ENABLED=y
CONFIG_SECURE_FLASH_ENCRYPTION_MODE_RELEASE=y
